docs/posts/2020-06-01-beamer-presentations-with-org-mode.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 23, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Beamer Presentations with Org Mode</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Beamer Presentations with Org Mode</h1>
<p class="subtitle" role="doc-subtitle">Jun 01, 2020</p>
</header><p>
When we moved all courses online for the semester because of the COVID-19 pandemic, I found myself having to make many more presentation slide-decks than I normally do, especially when I normally don&rsquo;t do any at all. Keynote produces some beautiful slides, but it requires using the mouse more than I like. I wanted something that I could use to make slides with just a few keystrokes. I settled on exporting an Org mode document to Beamer slides. This is an explanation of the challenges that I had and the solutions that I found.
</p>
<section id="outline-container-orgde7782e" class="outline-2">
<h2 id="orgde7782e">Beamer</h2>
<div class="outline-text-2" id="text-orgde7782e">
<p>
The Beamer class is a tool used to produce presentations with LaTeX. It provides the same advantages for presentations that standard LaTeX provides for other document types, including elegant mathematical formulas, transportability between computing platforms, and the ability focus on content when writing. There are disadvantages, though. Writing LaTeX can be cumbersome, since it is not a simple markup language. After gaining a certain proficiency, it is possible to write it fairly easily. Even so, it is never as simple as using something like Markdown.
</p>
</div>
</section>
<section id="outline-container-orga204a85" class="outline-2">
<h2 id="orga204a85">Solution</h2>
<div class="outline-text-2" id="text-orga204a85">
<p>
The solution that I found was Org mode, a very powerful system that includes a simple markup language and the ability to export to LaTeX. Producing the slide deck was easy, and there were many great examples online. Producing an article was also easy, again with great examples. Producing both a slide presentation and an article, using the same contents file should have been easy, since the official guide to Beamer explains how to do that in LaTeX. Unfortunately, I couldn&rsquo;t find much guidance on how to do this with Org Mode. The only article I could find was this on the official <a href="https://orgmode.org/worg/exporters/beamer/beamer-dual-format.html">Org mode site</a>. It seemed too complicated to me, and I was tempted to just go back to directly writing LaTeX. I decided to try anyway, but I quickly ran into a series of problems:
</p>

<ol class="org-ol">
<li>The Org Beamer export automatically inserted a title slide with <code>\maketitle</code>. Unfortunately, using the same content for the presentation and notes requires using the <code>ignorenonframetext</code> switch in the document class declaration. Since the export didn&rsquo;t place the command in a frame, there was no title slide.</li>
<li>I attempted to fix this by beginning the contents file with a title-less frame that included the <code>\maketitle</code> command. That generated a title page, but it came <i>after</i> the table of contents slide.</li>
<li>The article export did not treat headings correctly, and failed to recognize the Beamer-specific commands.</li>
</ol>

<p>
This was enough to make me want to scrap the project, especially when I looked at the site linked above. The author fixed the title issue by hacking the Beamer export file, something that I certainly didn&rsquo;t want to do. So, as is often the case, after hours of searching for solutions, I began to wonder if the solution could be much simpler than I (or anyone else, it seems) was thinking.
</p>
</div>
</section>
<section id="outline-container-orga88d23b" class="outline-2">
<h2 id="orga88d23b">Details</h2>
<div class="outline-text-2" id="text-orga88d23b">
<p>
I&rsquo;ll spare any reader the record of attempts, mistakes, other attempts, more mistakes, etc., and just get to the final workflow. I wrote a small script (in my case a function in Fish) that creates three files. One for the presentation, one for the article, and one for shared content. After creating the files, it opens a Dired buffer of the relevant folder in Emacs.
</p>

<p>
For those who use the Fish shell, here is the function:
</p>

<div class="org-src-container">
<pre class="src src-shell"><span class="org-keyword">function</span> <span class="org-function-name">lecture</span>
    touch {$<span class="org-variable-name">argv</span>}.org
    <span class="org-builtin">echo</span> -e <span class="org-string">'#+startup: beamer'</span> \n<span class="org-string">'#+TITLE: '</span> \n<span class="org-string">'#+AUTHOR: Dr. Ridenour'</span> \n<span class="org-string">'#+DATE: '</span> &gt;&gt;{$<span class="org-variable-name">argv</span>}.org
    touch {$<span class="org-variable-name">argv</span>}-beamer.org
    cat /Users/rlridenour/Dropbox/emacs/beamer/lecture-beamer.org &gt;{$<span class="org-variable-name">argv</span>}-beamer.org
    <span class="org-builtin">echo</span> -e <span class="org-string">'#+include: "'</span>{$<span class="org-variable-name">argv</span>}<span class="org-string">'.org" :minlevel 1'</span> &gt;&gt;{$<span class="org-variable-name">argv</span>}-beamer.org
    touch {$<span class="org-variable-name">argv</span>}-notes.org
    cat /Users/rlridenour/Dropbox/emacs/beamer/lecture-notes.org &gt;{$<span class="org-variable-name">argv</span>}-notes.org
    <span class="org-builtin">echo</span> -e <span class="org-string">'#+include: "'</span>{$<span class="org-variable-name">argv</span>}<span class="org-string">'.org" :minlevel 1'</span> &gt;&gt;{$<span class="org-variable-name">argv</span>}-notes.org
    dired
end 
</pre>
</div>

<p>
So, entering &ldquo;lecture kant&rdquo; in the shell will open a Dired buffer containg the files kant.org, kant-beamer.org, and kant-notes.org.
</p>
</div>
<div id="outline-container-org3565f45" class="outline-3">
<h3 id="org3565f45">Contents File</h3>
<div class="outline-text-3" id="text-org3565f45">
<p>
The contents file is a standard org file. Initially, I had it containing nothing in the header, except for possibly one line containing `#+startup: beamer`, which makes it easier to insert some Beamer-specific commands. After getting tired of entering the same data twice in the other files, I wondered if shared header information could just be placed in the contents file. Occasionally things work exactly how hoped they would, so no the function adds the following lines at the top of the contents file:
</p>

<pre class="example" id="orge31e322">
#+startup: beamer
#+TITLE:
#+AUTHOR: Dr. Ridenour
#+DATE: 
</pre>

<p>
You will need to decide what heading level will designate a slide. Don&rsquo;t worry, you&rsquo;ll still be able to use that heading level in the article, as I&rsquo;ll explain later. I use h3, so slides begin with a line like this in the contents file:
</p>

<pre class="example" id="org1343605">
*** Slide Title
</pre>

<p>
To add notes, you need to structurally separate the note content, which should only be printed on the article, from the preceding slide. To do this, add another h3 heading (I creatively title it &ldquo;Notes&rdquo;) with instructions to ignore the heading:
</p>


<pre class="example" id="orgd865ac1">
*** Notes :B_ignoreheading:
:PROPERTIES:
:BEAMER_env: ignoreheading
:END:
</pre>

<p>
Any text that follows will only appear in the article, not in the presentation. This does not have to be done for every successive note paragraph, it only needs to be done after a slide. So, any paragraphs that are in the scope of an h1 or h2 heading won&rsquo;t need that.
</p>
</div>
</div>
<div id="outline-container-org8fc3929" class="outline-3">
<h3 id="org8fc3929">Presentation File</h3>
<div class="outline-text-3" id="text-org8fc3929">
<p>
The magic happens with two small files. The first is the presentation file. At the top, put your preferred Beamer export header, but be sure to include <code>#+LaTeX_CLASS_options: [ignorenonframetext]</code> and <code>#+OPTIONS: toc:nil</code> . The latter is to ensure that Beamer export doesn&rsquo;t make the contents slide before the presentation title slide. Then, make the title page like this:
</p>


<pre class="example" id="orgc078101">
***
\maketitle 
</pre>


<p>
If you want a table of contents slide, you can do the same thing except use `\tableofcontents`. Finally, include the contents file with this line:
</p>

<pre class="example" id="org9b8297c">
#+include: "contents.org" :minlevel 1 
</pre>

<p>
I keep the header information in two files in Dropbox. The Fish function adds the header, the title and table of contents lines, and the link to the contents file 
</p>
</div>
</div>
<div id="outline-container-org9b31563" class="outline-3">
<h3 id="org9b31563">Article File</h3>
<div class="outline-text-3" id="text-org9b31563">
<p>
For the article, use your preferred header with all of the packages declared, but be sure to add this line: <code>#+LaTeX_HEADER: \usepackage{beamerarticle}</code>. After the export header lines, include the contents file, again using `#+include: &ldquo;contents.org&rdquo; :minlevel 1`. When exporting, be sure to export with the one of the Beamer-specific exports. Otherwise, things just won&rsquo;t look right.
</p>
</div>
</div>
</section>
<section id="outline-container-org17d7b50" class="outline-2">
<h2 id="org17d7b50">Conclusion</h2>
<div class="outline-text-2" id="text-org17d7b50">
<p>
There is one remaining problem that I have: the verse environment won&rsquo;t work in beamerarticle. That&rsquo;s a relatively small problem, though. I&rsquo;m certainly not an Org mode expert, so if anyone has questions or suggestions, please let me know. I hope this saves at least one person some time.
</p>

<p>
A sample can be found on <a href="https://github.com/rlridenour/beamer-sample">Github</a>.
</p>
</div>
</section>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 23, 2024.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
